tutorials/Zhang/U1nu4e-6STD0.1Trial1Case/0/epss
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epss;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
196256
(
0.458716
0.560029
0.627376
0.656647
0.566432
0.595001
0.766166
0.489337
...
)
;

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    walls
    {
        type            zeroGradient;
    }
    upperInlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    lowerInlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    rightInlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    leftInlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    walls2
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
