tutorials/Zhang/U1nu4e-6STD0.1Trial1Case/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.wetting.*"
    {
        nAlphaCorr      1;
        nAlphaSubCycles 4; 
        cAlpha          1; //compression term 

        MULESCorr       yes;
        nLimiterIter    3;

        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
    }

    pcorr
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-5;
        relTol          0;
    }

    pcorrFinal
    {
        $pcorr;
        relTol          0;
    }

    "(p_rgh|p)"
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.1;
	smoother        GaussSeidel;
    }

    "(p_rgh|p)Final"
    {
        $p_rgh;
        relTol          0;
    }

   "(U|Up|Us|k|epsilon|omega|f|v2)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          0.1;
	maxIter         1000;
    }

    "(U|Up|Us|k|epsilon)Final"
    {
        $U;
        relTol          0;
    }

  C
    {
        solver          smoothSolver;
	smoother        GaussSeidel;
        tolerance       1e-06;
        relTol          0.1;
    }    

    CFinal
    {
        $C;
        relTol          0;
    }

    epss
    {
        solver          smoothSolver;
	smoother        GaussSeidel;
        tolerance       1e-06;
        relTol          0;
    }    

    epssFinal
    {
        $epss;
        relTol          0;
    }

}

PIMPLE
{
    momentumPredictor   no;
    nOuterCorrectors    1;
    nCorrectors         3;
    nNonOrthogonalCorrectors 0;

    pRefCell    0;
    pRefValue    0;
}

relaxationFactors
{
    equations
    {
        ".*" 1;
    }
}


// ************************************************************************* //
